Changweibin/TEST/Drivers/FM33LD5xx_FL_Driver/Inc/fm33ld5xx_fl_gpio.h
/**
  * @brief    Get ALL PD EXTI digital filter enable status
  * @rmtoll   EXTIDFCD    DFD    FL_GPIO_ReadDigitalFilterPD
  * @param    GPIOx GPIO Port
  * @retval   EXTI digital filter enable status of port
  */
__STATIC_INLINE uint32_t FL_GPIO_ReadDigitalFilterPD(GPIO_COMMON_Type *GPIOx)
{
    return (uint32_t)(READ_BIT(GPIOx->EXTIDFCD, (0xffffU << 16U)) >> 16U);
}

/**
  * @brief    PE EXTI digital filter enable
  * @rmtoll   EXTIDFEF    DFE    FL_GPIO_EnableDigitalFilterPE
  * @param    GPIOx GPIO Port
  * @param    pin This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_PIN_0
  *           @arg @ref FL_GPIO_PIN_1
  *           @arg @ref FL_GPIO_PIN_2
  *           @arg @ref FL_GPIO_PIN_3
  *           @arg @ref FL_GPIO_PIN_4
  *           @arg @ref FL_GPIO_PIN_5
  *           @arg @ref FL_GPIO_PIN_6
  *           @arg @ref FL_GPIO_PIN_7
  *           @arg @ref FL_GPIO_PIN_8
  *           @arg @ref FL_GPIO_PIN_9
  *           @arg @ref FL_GPIO_PIN_10
  *           @arg @ref FL_GPIO_PIN_11
  *           @arg @ref FL_GPIO_PIN_12
  *           @arg @ref FL_GPIO_PIN_13
  *           @arg @ref FL_GPIO_PIN_14
  *           @arg @ref FL_GPIO_PIN_15
  *           @arg @ref FL_GPIO_PIN_ALL
  * @retval   None
  */
__STATIC_INLINE void FL_GPIO_EnableDigitalFilterPE(GPIO_COMMON_Type *GPIOx, uint32_t pin)
{
    SET_BIT(GPIOx->EXTIDFEF, ((pin & 0xffff) << 0x0U));
}

/**
  * @brief    PE EXTI digital filter disable
  * @rmtoll   EXTIDFEF    DFE    FL_GPIO_DisableDigitalFilterPE
  * @param    GPIOx GPIO Port
  * @param    pin This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_PIN_0
  *           @arg @ref FL_GPIO_PIN_1
  *           @arg @ref FL_GPIO_PIN_2
  *           @arg @ref FL_GPIO_PIN_3
  *           @arg @ref FL_GPIO_PIN_4
  *           @arg @ref FL_GPIO_PIN_5
  *           @arg @ref FL_GPIO_PIN_6
  *           @arg @ref FL_GPIO_PIN_7
  *           @arg @ref FL_GPIO_PIN_8
  *           @arg @ref FL_GPIO_PIN_9
  *           @arg @ref FL_GPIO_PIN_10
  *           @arg @ref FL_GPIO_PIN_11
  *           @arg @ref FL_GPIO_PIN_12
  *           @arg @ref FL_GPIO_PIN_13
  *           @arg @ref FL_GPIO_PIN_14
  *           @arg @ref FL_GPIO_PIN_15
  *           @arg @ref FL_GPIO_PIN_ALL
  * @retval   None
  */
__STATIC_INLINE void FL_GPIO_DisableDigitalFilterPE(GPIO_COMMON_Type *GPIOx, uint32_t pin)
{
    CLEAR_BIT(GPIOx->EXTIDFEF, ((pin & 0xffff) << 0x0U));
}

/**
  * @brief    Get PE EXTI digital filter enable status
  * @rmtoll   EXTIDFEF    DFE    FL_GPIO_IsEnabledDigitalFilterPE
  * @param    GPIOx GPIO Port
  * @param    pin This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_PIN_0
  *           @arg @ref FL_GPIO_PIN_1
  *           @arg @ref FL_GPIO_PIN_2
  *           @arg @ref FL_GPIO_PIN_3
  *           @arg @ref FL_GPIO_PIN_4
  *           @arg @ref FL_GPIO_PIN_5
  *           @arg @ref FL_GPIO_PIN_6
  *           @arg @ref FL_GPIO_PIN_7
  *           @arg @ref FL_GPIO_PIN_8
  *           @arg @ref FL_GPIO_PIN_9
  *           @arg @ref FL_GPIO_PIN_10
  *           @arg @ref FL_GPIO_PIN_11
  *           @arg @ref FL_GPIO_PIN_12
  *           @arg @ref FL_GPIO_PIN_13
  *           @arg @ref FL_GPIO_PIN_14
  *           @arg @ref FL_GPIO_PIN_15
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_GPIO_IsEnabledDigitalFilterPE(GPIO_COMMON_Type *GPIOx, uint32_t pin)
{
    return (uint32_t)(READ_BIT(GPIOx->EXTIDFEF, ((pin & 0xffff) << 0x0U)) == ((pin & 0xffff) << 0x0U));
}

/**
  * @brief    Get ALl PE EXTI digital filter enable status
  * @rmtoll   EXTIDFEF    DFE    FL_GPIO_ReadDigitalFilterPE
  * @param    GPIOx GPIO Port
  * @retval   EXTI digital filter enable status of port
  */
__STATIC_INLINE uint32_t FL_GPIO_ReadDigitalFilterPE(GPIO_COMMON_Type *GPIOx)
{
    return (uint32_t)(READ_BIT(GPIOx->EXTIDFEF, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    PF EXTI digital filter enable
  * @rmtoll   EXTIDFEF    DFF    FL_GPIO_EnableDigitalFilterPF
  * @param    GPIOx GPIO Port
  * @param    pin This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_PIN_0
  *           @arg @ref FL_GPIO_PIN_1
  *           @arg @ref FL_GPIO_PIN_2
  *           @arg @ref FL_GPIO_PIN_3
  *           @arg @ref FL_GPIO_PIN_4
  *           @arg @ref FL_GPIO_PIN_5
  *           @arg @ref FL_GPIO_PIN_6
  *           @arg @ref FL_GPIO_PIN_7
  *           @arg @ref FL_GPIO_PIN_8
  *           @arg @ref FL_GPIO_PIN_9
  *           @arg @ref FL_GPIO_PIN_10
  *           @arg @ref FL_GPIO_PIN_11
  *           @arg @ref FL_GPIO_PIN_12
  *           @arg @ref FL_GPIO_PIN_13
  *           @arg @ref FL_GPIO_PIN_14
  *           @arg @ref FL_GPIO_PIN_15
  *           @arg @ref FL_GPIO_PIN_ALL
  * @retval   None
  */
__STATIC_INLINE void FL_GPIO_EnableDigitalFilterPF(GPIO_COMMON_Type *GPIOx, uint32_t pin)
{
    SET_BIT(GPIOx->EXTIDFEF, ((pin & 0xffff) << 0x10U));
}

/**
  * @brief    PF EXTI digital filter disable
  * @rmtoll   EXTIDFEF    DFF    FL_GPIO_DisableDigitalFilterPF
  * @param    GPIOx GPIO Port
  * @param    pin This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_PIN_0
  *           @arg @ref FL_GPIO_PIN_1
  *           @arg @ref FL_GPIO_PIN_2
  *           @arg @ref FL_GPIO_PIN_3
  *           @arg @ref FL_GPIO_PIN_4
  *           @arg @ref FL_GPIO_PIN_5
  *           @arg @ref FL_GPIO_PIN_6
  *           @arg @ref FL_GPIO_PIN_7
  *           @arg @ref FL_GPIO_PIN_8
  *           @arg @ref FL_GPIO_PIN_9
  *           @arg @ref FL_GPIO_PIN_10
  *           @arg @ref FL_GPIO_PIN_11
  *           @arg @ref FL_GPIO_PIN_12
  *           @arg @ref FL_GPIO_PIN_13
  *           @arg @ref FL_GPIO_PIN_14
  *           @arg @ref FL_GPIO_PIN_15
  *           @arg @ref FL_GPIO_PIN_ALL
  * @retval   None
  */
__STATIC_INLINE void FL_GPIO_DisableDigitalFilterPF(GPIO_COMMON_Type *GPIOx, uint32_t pin)
{
    CLEAR_BIT(GPIOx->EXTIDFEF, ((pin & 0xffff) << 0x10U));
}

/**
  * @brief    Get PF EXTI digital filter enable status
  * @rmtoll   EXTIDFEF    DFF    FL_GPIO_IsEnabledDigitalFilterPF
  * @param    GPIOx GPIO Port
  * @param    pin This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_PIN_0
  *           @arg @ref FL_GPIO_PIN_1
  *           @arg @ref FL_GPIO_PIN_2
  *           @arg @ref FL_GPIO_PIN_3
  *           @arg @ref FL_GPIO_PIN_4
  *           @arg @ref FL_GPIO_PIN_5
  *           @arg @ref FL_GPIO_PIN_6
  *           @arg @ref FL_GPIO_PIN_7
  *           @arg @ref FL_GPIO_PIN_8
  *           @arg @ref FL_GPIO_PIN_9
  *           @arg @ref FL_GPIO_PIN_10
  *           @arg @ref FL_GPIO_PIN_11
  *           @arg @ref FL_GPIO_PIN_12
  *           @arg @ref FL_GPIO_PIN_13
  *           @arg @ref FL_GPIO_PIN_14
  *           @arg @ref FL_GPIO_PIN_15
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_GPIO_IsEnabledDigitalFilterPF(GPIO_COMMON_Type *GPIOx, uint32_t pin)
{
    return (uint32_t)(READ_BIT(GPIOx->EXTIDFEF, ((pin & 0xffff) << 0x10U)) == ((pin & 0xffff) << 0x10U));
}

/**
  * @brief    Get ALL PF EXTI digital filter enable status
  * @rmtoll   EXTIDFEF    DFF    FL_GPIO_ReadDigitalFilterPF
  * @param    GPIOx GPIO Port
  * @retval   EXTI digital filter enable status of port
  */
__STATIC_INLINE uint32_t FL_GPIO_ReadDigitalFilterPF(GPIO_COMMON_Type *GPIOx)
{
    return (uint32_t)(READ_BIT(GPIOx->EXTIDFEF, (0xffffU << 16U)) >> 16U);
}

/**
  * @brief    PG EXTI digital filter enable
  * @rmtoll   EXTIDFGH    DFG    FL_GPIO_EnableDigitalFilterPG
  * @param    GPIOx GPIO Port
  * @param    pin This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_PIN_0
  *           @arg @ref FL_GPIO_PIN_1
  *           @arg @ref FL_GPIO_PIN_2
  *           @arg @ref FL_GPIO_PIN_3
  *           @arg @ref FL_GPIO_PIN_4
  *           @arg @ref FL_GPIO_PIN_5
  *           @arg @ref FL_GPIO_PIN_6
  *           @arg @ref FL_GPIO_PIN_7
  *           @arg @ref FL_GPIO_PIN_8
  *           @arg @ref FL_GPIO_PIN_9
  *           @arg @ref FL_GPIO_PIN_10
  *           @arg @ref FL_GPIO_PIN_11
  *           @arg @ref FL_GPIO_PIN_12
  *           @arg @ref FL_GPIO_PIN_13
  *           @arg @ref FL_GPIO_PIN_14
  *           @arg @ref FL_GPIO_PIN_15
  *           @arg @ref FL_GPIO_PIN_ALL
  * @retval   None
  */
__STATIC_INLINE void FL_GPIO_EnableDigitalFilterPG(GPIO_COMMON_Type *GPIOx, uint32_t pin)
{
    SET_BIT(GPIOx->EXTIDFGH, ((pin & 0xffff) << 0x0U));
}

/**
  * @brief    PG EXTI digital filter disable
  * @rmtoll   EXTIDFGH    DFG    FL_GPIO_DisableDigitalFilterPG
  * @param    GPIOx GPIO Port
  * @param    pin This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_PIN_0
  *           @arg @ref FL_GPIO_PIN_1
  *           @arg @ref FL_GPIO_PIN_2
  *           @arg @ref FL_GPIO_PIN_3
  *           @arg @ref FL_GPIO_PIN_4
  *           @arg @ref FL_GPIO_PIN_5
  *           @arg @ref FL_GPIO_PIN_6
  *           @arg @ref FL_GPIO_PIN_7
  *           @arg @ref FL_GPIO_PIN_8
  *           @arg @ref FL_GPIO_PIN_9
  *           @arg @ref FL_GPIO_PIN_10
  *           @arg @ref FL_GPIO_PIN_11
  *           @arg @ref FL_GPIO_PIN_12
  *           @arg @ref FL_GPIO_PIN_13
  *           @arg @ref FL_GPIO_PIN_14
  *           @arg @ref FL_GPIO_PIN_15
  *           @arg @ref FL_GPIO_PIN_ALL
  * @retval   None
  */
__STATIC_INLINE void FL_GPIO_DisableDigitalFilterPG(GPIO_COMMON_Type *GPIOx, uint32_t pin)
{
    CLEAR_BIT(GPIOx->EXTIDFGH, ((pin & 0xffff) << 0x0U));
}

/**
  * @brief    Get PG EXTI digital filter enable status
  * @rmtoll   EXTIDFGH    DFG    FL_GPIO_IsEnabledDigitalFilterPG
  * @param    GPIOx GPIO Port
  * @param    pin This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_PIN_0
  *           @arg @ref FL_GPIO_PIN_1
  *           @arg @ref FL_GPIO_PIN_2
  *           @arg @ref FL_GPIO_PIN_3
  *           @arg @ref FL_GPIO_PIN_4
  *           @arg @ref FL_GPIO_PIN_5
  *           @arg @ref FL_GPIO_PIN_6
  *           @arg @ref FL_GPIO_PIN_7
  *           @arg @ref FL_GPIO_PIN_8
  *           @arg @ref FL_GPIO_PIN_9
  *           @arg @ref FL_GPIO_PIN_10
  *           @arg @ref FL_GPIO_PIN_11
  *           @arg @ref FL_GPIO_PIN_12
  *           @arg @ref FL_GPIO_PIN_13
  *           @arg @ref FL_GPIO_PIN_14
  *           @arg @ref FL_GPIO_PIN_15
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_GPIO_IsEnabledDigitalFilterPG(GPIO_COMMON_Type *GPIOx, uint32_t pin)
{
    return (uint32_t)(READ_BIT(GPIOx->EXTIDFGH, ((pin & 0xffff) << 0x0U)) == ((pin & 0xffff) << 0x0U));
}

/**
  * @brief    Get ALL PG EXTI digital filter enable status
  * @rmtoll   EXTIDFGH    DFG    FL_GPIO_ReadDigitalFilterPG
  * @param    GPIOx GPIO Port
  * @retval   EXTI digital filter enable status of port
  */
__STATIC_INLINE uint32_t FL_GPIO_ReadDigitalFilterPG(GPIO_COMMON_Type *GPIOx)
{
    return (uint32_t)(READ_BIT(GPIOx->EXTIDFGH, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    PH EXTI digital filter enable
  * @rmtoll   EXTIDFGH    DFH    FL_GPIO_EnableDigitalFilterPH
  * @param    GPIOx GPIO Port
  * @param    pin This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_PIN_0
  *           @arg @ref FL_GPIO_PIN_1
  *           @arg @ref FL_GPIO_PIN_2
  *           @arg @ref FL_GPIO_PIN_3
  *           @arg @ref FL_GPIO_PIN_4
  *           @arg @ref FL_GPIO_PIN_5
  *           @arg @ref FL_GPIO_PIN_6
  *           @arg @ref FL_GPIO_PIN_7
  *           @arg @ref FL_GPIO_PIN_8
  *           @arg @ref FL_GPIO_PIN_9
  *           @arg @ref FL_GPIO_PIN_10
  *           @arg @ref FL_GPIO_PIN_11
  *           @arg @ref FL_GPIO_PIN_12
  *           @arg @ref FL_GPIO_PIN_13
  *           @arg @ref FL_GPIO_PIN_14
  *           @arg @ref FL_GPIO_PIN_15
  *           @arg @ref FL_GPIO_PIN_ALL
  * @retval   None
  */
__STATIC_INLINE void FL_GPIO_EnableDigitalFilterPH(GPIO_COMMON_Type *GPIOx, uint32_t pin)
{
    SET_BIT(GPIOx->EXTIDFGH, ((pin & 0xffff) << 0x10U));
}

/**
  * @brief    PH EXTI digital filter disable
  * @rmtoll   EXTIDFGH    DFH    FL_GPIO_DisableDigitalFilterPH
  * @param    GPIOx GPIO Port
  * @param    pin This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_PIN_0
  *           @arg @ref FL_GPIO_PIN_1
  *           @arg @ref FL_GPIO_PIN_2
  *           @arg @ref FL_GPIO_PIN_3
  *           @arg @ref FL_GPIO_PIN_4
  *           @arg @ref FL_GPIO_PIN_5
  *           @arg @ref FL_GPIO_PIN_6
  *           @arg @ref FL_GPIO_PIN_7
  *           @arg @ref FL_GPIO_PIN_8
  *           @arg @ref FL_GPIO_PIN_9
  *           @arg @ref FL_GPIO_PIN_10
  *           @arg @ref FL_GPIO_PIN_11
  *           @arg @ref FL_GPIO_PIN_12
  *           @arg @ref FL_GPIO_PIN_13
  *           @arg @ref FL_GPIO_PIN_14
  *           @arg @ref FL_GPIO_PIN_15
  *           @arg @ref FL_GPIO_PIN_ALL
  * @retval   None
  */
__STATIC_INLINE void FL_GPIO_DisableDigitalFilterPH(GPIO_COMMON_Type *GPIOx, uint32_t pin)
{
    CLEAR_BIT(GPIOx->EXTIDFGH, ((pin & 0xffff) << 0x10U));
}

/**
  * @brief    Get PH EXTI digital filter enable status
  * @rmtoll   EXTIDFGH    DFH    FL_GPIO_IsEnabledDigitalFilterPH
  * @param    GPIOx GPIO Port
  * @param    pin This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_PIN_0
  *           @arg @ref FL_GPIO_PIN_1
  *           @arg @ref FL_GPIO_PIN_2
  *           @arg @ref FL_GPIO_PIN_3
  *           @arg @ref FL_GPIO_PIN_4
  *           @arg @ref FL_GPIO_PIN_5
  *           @arg @ref FL_GPIO_PIN_6
  *           @arg @ref FL_GPIO_PIN_7
  *           @arg @ref FL_GPIO_PIN_8
  *           @arg @ref FL_GPIO_PIN_9
  *           @arg @ref FL_GPIO_PIN_10
  *           @arg @ref FL_GPIO_PIN_11
  *           @arg @ref FL_GPIO_PIN_12
  *           @arg @ref FL_GPIO_PIN_13
  *           @arg @ref FL_GPIO_PIN_14
  *           @arg @ref FL_GPIO_PIN_15
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_GPIO_IsEnabledDigitalFilterPH(GPIO_COMMON_Type *GPIOx, uint32_t pin)
{
    return (uint32_t)(READ_BIT(GPIOx->EXTIDFGH, ((pin & 0xffff) << 0x10U)) == ((pin & 0xffff) << 0x10U));
}

/**
  * @brief    Get ALL PH EXTI digital filter enable status
  * @rmtoll   EXTIDFGH    DFH    FL_GPIO_ReadDigitalFilterPH
  * @param    GPIOx GPIO Port
  * @retval   EXTI digital filter enable status of port
  */
__STATIC_INLINE uint32_t FL_GPIO_ReadDigitalFilterPH(GPIO_COMMON_Type *GPIOx)
{
    return (uint32_t)(READ_BIT(GPIOx->EXTIDFGH, (0xffffU << 16U)) >> 16U);
}

/**
  * @brief    Get PA external interrupt flag status
  * @rmtoll   EXTIISRAB    ISRA    FL_GPIO_ReadEXTI_PA
  * @param    GPIOx GPIO Port
  * @retval   EXTI flag status of port
  */
__STATIC_INLINE uint32_t FL_GPIO_ReadEXTI_PA(GPIO_COMMON_Type *GPIOx)
{
    return (uint32_t)(READ_BIT(GPIOx->EXTIISRAB, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    Get PA external interrupt flag status
  * @rmtoll   EXTIISRAB    ISRA    FL_GPIO_IsActiveFlag_EXTI_PA
  * @param    GPIOx GPIO Port
  * @param    pin This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_PIN_0
  *           @arg @ref FL_GPIO_PIN_1
  *           @arg @ref FL_GPIO_PIN_2
  *           @arg @ref FL_GPIO_PIN_3
  *           @arg @ref FL_GPIO_PIN_4
  *           @arg @ref FL_GPIO_PIN_5
  *           @arg @ref FL_GPIO_PIN_6
  *           @arg @ref FL_GPIO_PIN_7
  *           @arg @ref FL_GPIO_PIN_8
  *           @arg @ref FL_GPIO_PIN_9
  *           @arg @ref FL_GPIO_PIN_10
  *           @arg @ref FL_GPIO_PIN_11
  *           @arg @ref FL_GPIO_PIN_12
  *           @arg @ref FL_GPIO_PIN_13
  *           @arg @ref FL_GPIO_PIN_14
  *           @arg @ref FL_GPIO_PIN_15
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_GPIO_IsActiveFlag_EXTI_PA(GPIO_COMMON_Type *GPIOx, uint32_t pin)
{
    return (uint32_t)(READ_BIT(GPIOx->EXTIISRAB, ((pin & 0xffff) << 0x0U)) == ((pin & 0xffff) << 0x0U));
}

/**
  * @brief    Clear PA external interrupt flag 
  * @rmtoll   EXTIISRAB    ISRA    FL_GPIO_ClearFlag_EXTI_PA
  * @param    GPIOx GPIO Port
  * @param    pin This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_PIN_0
  *           @arg @ref FL_GPIO_PIN_1
  *           @arg @ref FL_GPIO_PIN_2
  *           @arg @ref FL_GPIO_PIN_3
  *           @arg @ref FL_GPIO_PIN_4
  *           @arg @ref FL_GPIO_PIN_5
  *           @arg @ref FL_GPIO_PIN_6
  *           @arg @ref FL_GPIO_PIN_7
  *           @arg @ref FL_GPIO_PIN_8
  *           @arg @ref FL_GPIO_PIN_9
  *           @arg @ref FL_GPIO_PIN_10
  *           @arg @ref FL_GPIO_PIN_11
  *           @arg @ref FL_GPIO_PIN_12
  *           @arg @ref FL_GPIO_PIN_13
  *           @arg @ref FL_GPIO_PIN_14
  *           @arg @ref FL_GPIO_PIN_15
  *           @arg @ref FL_GPIO_PIN_ALL
  * @retval   None
  */
__STATIC_INLINE void FL_GPIO_ClearFlag_EXTI_PA(GPIO_COMMON_Type *GPIOx, uint32_t pin)
{
    WRITE_REG(GPIOx->EXTIISRAB, ((pin & 0xffff) << 0x0U));
}

/**
  * @brief    Get PB external interrupt flag status
  * @rmtoll   EXTIISRAB    ISRB    FL_GPIO_ReadEXTI_PB
  * @param    GPIOx GPIO Port
  * @retval   EXTI flag status of port
  */
__STATIC_INLINE uint32_t FL_GPIO_ReadEXTI_PB(GPIO_COMMON_Type *GPIOx)
{
    return (uint32_t)(READ_BIT(GPIOx->EXTIISRAB, (0xffffU << 16U)) >> 16U);
}

/**
  * @brief    Get PB external interrupt flag status
  * @rmtoll   EXTIISRAB    ISRB    FL_GPIO_IsActiveFlag_EXTI_PB
  * @param    GPIOx GPIO Port
  * @param    pin This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_PIN_0
  *           @arg @ref FL_GPIO_PIN_1
  *           @arg @ref FL_GPIO_PIN_2
  *           @arg @ref FL_GPIO_PIN_3
  *           @arg @ref FL_GPIO_PIN_4
  *           @arg @ref FL_GPIO_PIN_5
  *           @arg @ref FL_GPIO_PIN_6
  *           @arg @ref FL_GPIO_PIN_7
  *           @arg @ref FL_GPIO_PIN_8
  *           @arg @ref FL_GPIO_PIN_9
  *           @arg @ref FL_GPIO_PIN_10
  *           @arg @ref FL_GPIO_PIN_11
  *           @arg @ref FL_GPIO_PIN_12
  *           @arg @ref FL_GPIO_PIN_13
  *           @arg @ref FL_GPIO_PIN_14
  *           @arg @ref FL_GPIO_PIN_15
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_GPIO_IsActiveFlag_EXTI_PB(GPIO_COMMON_Type *GPIOx, uint32_t pin)
{
    return (uint32_t)(READ_BIT(GPIOx->EXTIISRAB, ((pin & 0xffff) << 0x10U)) == ((pin & 0xffff) << 0x10U));
}

/**
  * @brief    Clear PB external interrupt flag 
  * @rmtoll   EXTIISRAB    ISRB    FL_GPIO_ClearFlag_EXTI_PB
  * @param    GPIOx GPIO Port
  * @param    pin This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_PIN_0
  *           @arg @ref FL_GPIO_PIN_1
  *           @arg @ref FL_GPIO_PIN_2
  *           @arg @ref FL_GPIO_PIN_3
  *           @arg @ref FL_GPIO_PIN_4
  *           @arg @ref FL_GPIO_PIN_5
  *           @arg @ref FL_GPIO_PIN_6
  *           @arg @ref FL_GPIO_PIN_7
  *           @arg @ref FL_GPIO_PIN_8
  *           @arg @ref FL_GPIO_PIN_9
  *           @arg @ref FL_GPIO_PIN_10
  *           @arg @ref FL_GPIO_PIN_11
  *           @arg @ref FL_GPIO_PIN_12
  *           @arg @ref FL_GPIO_PIN_13
  *           @arg @ref FL_GPIO_PIN_14
  *           @arg @ref FL_GPIO_PIN_15
  *           @arg @ref FL_GPIO_PIN_ALL
  * @retval   None
  */
__STATIC_INLINE void FL_GPIO_ClearFlag_EXTI_PB(GPIO_COMMON_Type *GPIOx, uint32_t pin)
{
    WRITE_REG(GPIOx->EXTIISRAB, ((pin & 0xffff) << 0x10U));
}

/**
  * @brief    Get PC external interrupt flag status
  * @rmtoll   EXTIISRCD    ISRC    FL_GPIO_ReadEXTI_PC
  * @param    GPIOx GPIO Port
  * @retval   EXTI flag status of port
  */
__STATIC_INLINE uint32_t FL_GPIO_ReadEXTI_PC(GPIO_COMMON_Type *GPIOx)
{
    return (uint32_t)(READ_BIT(GPIOx->EXTIISRCD, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    Get PC external interrupt flag status
  * @rmtoll   EXTIISRCD    ISRC    FL_GPIO_IsActiveFlag_EXTI_PC
  * @param    GPIOx GPIO Port
  * @param    pin This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_PIN_0
  *           @arg @ref FL_GPIO_PIN_1
  *           @arg @ref FL_GPIO_PIN_2
  *           @arg @ref FL_GPIO_PIN_3
  *           @arg @ref FL_GPIO_PIN_4
  *           @arg @ref FL_GPIO_PIN_5
  *           @arg @ref FL_GPIO_PIN_6
  *           @arg @ref FL_GPIO_PIN_7
  *           @arg @ref FL_GPIO_PIN_8
  *           @arg @ref FL_GPIO_PIN_9
  *           @arg @ref FL_GPIO_PIN_10
  *           @arg @ref FL_GPIO_PIN_11
  *           @arg @ref FL_GPIO_PIN_12
  *           @arg @ref FL_GPIO_PIN_13
  *           @arg @ref FL_GPIO_PIN_14
  *           @arg @ref FL_GPIO_PIN_15
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_GPIO_IsActiveFlag_EXTI_PC(GPIO_COMMON_Type *GPIOx, uint32_t pin)
{
    return (uint32_t)(READ_BIT(GPIOx->EXTIISRCD, ((pin & 0xffff) << 0x0U)) == ((pin & 0xffff) << 0x0U));
}

/**
  * @brief    Clear PC external interrupt flag 
  * @rmtoll   EXTIISRCD    ISRC    FL_GPIO_ClearFlag_EXTI_PC
  * @param    GPIOx GPIO Port
  * @param    pin This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_PIN_0
  *           @arg @ref FL_GPIO_PIN_1
  *           @arg @ref FL_GPIO_PIN_2
  *           @arg @ref FL_GPIO_PIN_3
  *           @arg @ref FL_GPIO_PIN_4
  *           @arg @ref FL_GPIO_PIN_5
  *           @arg @ref FL_GPIO_PIN_6
  *           @arg @ref FL_GPIO_PIN_7
  *           @arg @ref FL_GPIO_PIN_8
  *           @arg @ref FL_GPIO_PIN_9
  *           @arg @ref FL_GPIO_PIN_10
  *           @arg @ref FL_GPIO_PIN_11
  *           @arg @ref FL_GPIO_PIN_12
  *           @arg @ref FL_GPIO_PIN_13
  *           @arg @ref FL_GPIO_PIN_14
  *           @arg @ref FL_GPIO_PIN_15
  *           @arg @ref FL_GPIO_PIN_ALL
  * @retval   None
  */
__STATIC_INLINE void FL_GPIO_ClearFlag_EXTI_PC(GPIO_COMMON_Type *GPIOx, uint32_t pin)
{
    WRITE_REG(GPIOx->EXTIISRCD, ((pin & 0xffff) << 0x0U));
}

/**
  * @brief    Get PD external interrupt flag status
  * @rmtoll   EXTIISRCD    ISRD    FL_GPIO_ReadEXTI_PD
  * @param    GPIOx GPIO Port
  * @retval   EXTI flag status of port
  */
__STATIC_INLINE uint32_t FL_GPIO_ReadEXTI_PD(GPIO_COMMON_Type *GPIOx)
{
    return (uint32_t)(READ_BIT(GPIOx->EXTIISRCD, (0xffffU << 16U)) >> 16U);
}

