Changweibin/TEST/Drivers/FM33LD5xx_FL_Driver/Inc/fm33ld5xx_fl_gpio.h
/**
  * @brief    Set PD11 or PE7 frequency output
  * @rmtoll   FOUTSEL    FOUT0    FL_GPIO_SetFOUT0
  * @param    GPIOx GPIO Port
  * @param    select This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_FOUT0_SELECT_XTHF_DIV64
  *           @arg @ref FL_GPIO_FOUT0_SELECT_RCLP
  *           @arg @ref FL_GPIO_FOUT0_SELECT_RCHF_DIV64
  *           @arg @ref FL_GPIO_FOUT0_SELECT_RCHF16_DIV64
  *           @arg @ref FL_GPIO_FOUT0_SELECT_AHBCLK_DIV64
  *           @arg @ref FL_GPIO_FOUT0_SELECT_PLL_DIV64
  *           @arg @ref FL_GPIO_FOUT0_SELECT_APBCLK1_DIV64
  *           @arg @ref FL_GPIO_FOUT0_SELECT_APBCLK2_DIV64
  *           @arg @ref FL_GPIO_FOUT0_SELECT_ADC0_SOC
  *           @arg @ref FL_GPIO_FOUT0_SELECT_ADC1_SOC
  *           @arg @ref FL_GPIO_FOUT0_SELECT_ADC2_SOC
  *           @arg @ref FL_GPIO_FOUT0_SELECT_ADC3_SOC
  *           @arg @ref FL_GPIO_FOUT0_SELECT_ADC0_CLK_DIV64
  *           @arg @ref FL_GPIO_FOUT0_SELECT_SVD
  *           @arg @ref FL_GPIO_FOUT0_SELECT_BGQS_SWEN1
  *           @arg @ref FL_GPIO_FOUT0_SELECT_BGQS_SWEN2
	*           @arg @ref FL_GPIO_FOUT0_SELECT_HFDET
  * @retval   None
  */
__STATIC_INLINE void FL_GPIO_SetFOUT0(GPIO_COMMON_Type *GPIOx, uint32_t select)
{
    MODIFY_REG(GPIOx->FOUTSEL, GPIO_FOUTSEL_FOUT0_Msk, select);
}

/**
  * @brief    Get  PD11 or PE7 frequency output
  * @rmtoll   FOUTSEL    FOUT0    FL_GPIO_GetFOUT0
  * @param    GPIOx GPIO Port
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_GPIO_FOUT0_SELECT_XTHF_DIV64
  *           @arg @ref FL_GPIO_FOUT0_SELECT_RCLP
  *           @arg @ref FL_GPIO_FOUT0_SELECT_RCHF_DIV64
  *           @arg @ref FL_GPIO_FOUT0_SELECT_RCHF16_DIV64
  *           @arg @ref FL_GPIO_FOUT0_SELECT_AHBCLK_DIV64
  *           @arg @ref FL_GPIO_FOUT0_SELECT_PLL_DIV64
  *           @arg @ref FL_GPIO_FOUT0_SELECT_APBCLK1_DIV64
  *           @arg @ref FL_GPIO_FOUT0_SELECT_APBCLK2_DIV64
  *           @arg @ref FL_GPIO_FOUT0_SELECT_ADC0_SOC
  *           @arg @ref FL_GPIO_FOUT0_SELECT_ADC1_SOC
  *           @arg @ref FL_GPIO_FOUT0_SELECT_ADC2_SOC
  *           @arg @ref FL_GPIO_FOUT0_SELECT_ADC3_SOC
  *           @arg @ref FL_GPIO_FOUT0_SELECT_ADC0_CLK_DIV64
  *           @arg @ref FL_GPIO_FOUT0_SELECT_SVD
  *           @arg @ref FL_GPIO_FOUT0_SELECT_BGQS_SWEN1
  *           @arg @ref FL_GPIO_FOUT0_SELECT_BGQS_SWEN2
	*           @arg @ref FL_GPIO_FOUT0_SELECT_HFDET
  */
__STATIC_INLINE uint32_t FL_GPIO_GetFOUT0(GPIO_COMMON_Type *GPIOx)
{
    return (uint32_t)(READ_BIT(GPIOx->FOUTSEL, GPIO_FOUTSEL_FOUT0_Msk));
}

/**
  * @brief    Set PB12 frequency output
  * @rmtoll   FOUTSEL    FOUT1    FL_GPIO_SetFOUT1
  * @param    GPIOx GPIO Port
  * @param    select This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_FOUT1_SELECT_XTHF_DIV64
  *           @arg @ref FL_GPIO_FOUT1_SELECT_RCLP
  *           @arg @ref FL_GPIO_FOUT1_SELECT_RCHF_DIV64
  *           @arg @ref FL_GPIO_FOUT1_SELECT_RCHF16_DIV64
  *           @arg @ref FL_GPIO_FOUT1_SELECT_AHBCLK_DIV64
  *           @arg @ref FL_GPIO_FOUT1_SELECT_PLL_DIV64
	*           @arg @ref FL_GPIO_FOUT1_SELECT_XTHF
  *           @arg @ref FL_GPIO_FOUT1_SELECT_HFDET
  *           @arg @ref FL_GPIO_FOUT1_SELECT_CANFD0
  *           @arg @ref FL_GPIO_FOUT1_SELECT_ADC0_SOC
  *           @arg @ref FL_GPIO_FOUT1_SELECT_ADC1_SOC
  *           @arg @ref FL_GPIO_FOUT1_SELECT_ADC2_SOC
  *           @arg @ref FL_GPIO_FOUT1_SELECT_ADC3_SOC
  *           @arg @ref FL_GPIO_FOUT1_SELECT_AT0BRKLUT
  *           @arg @ref FL_GPIO_FOUT1_SELECT_AT1BRKLUT
  *           @arg @ref FL_GPIO_FOUT1_SELECT_AT2BRKLUT
  * @retval   None
  */
__STATIC_INLINE void FL_GPIO_SetFOUT1(GPIO_COMMON_Type *GPIOx, uint32_t select)
{
    MODIFY_REG(GPIOx->FOUTSEL, GPIO_FOUTSEL_FOUT1_Msk, select);
}

/**
  * @brief    Get PB12 frequency output
  * @rmtoll   FOUTSEL    FOUT1    FL_GPIO_GetFOUT1
  * @param    GPIOx GPIO Port
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_GPIO_FOUT1_SELECT_XTHF_DIV64
  *           @arg @ref FL_GPIO_FOUT1_SELECT_RCLP
  *           @arg @ref FL_GPIO_FOUT1_SELECT_RCHF_DIV64
  *           @arg @ref FL_GPIO_FOUT1_SELECT_RCHF16_DIV64
  *           @arg @ref FL_GPIO_FOUT1_SELECT_AHBCLK_DIV64
  *           @arg @ref FL_GPIO_FOUT1_SELECT_PLL_DIV64
	*           @arg @ref FL_GPIO_FOUT1_SELECT_XTHF
  *           @arg @ref FL_GPIO_FOUT1_SELECT_HFDET
  *           @arg @ref FL_GPIO_FOUT1_SELECT_CANFD0
  *           @arg @ref FL_GPIO_FOUT1_SELECT_ADC0_SOC
  *           @arg @ref FL_GPIO_FOUT1_SELECT_ADC1_SOC
  *           @arg @ref FL_GPIO_FOUT1_SELECT_ADC2_SOC
  *           @arg @ref FL_GPIO_FOUT1_SELECT_ADC3_SOC
  *           @arg @ref FL_GPIO_FOUT1_SELECT_AT0BRKLUT
  *           @arg @ref FL_GPIO_FOUT1_SELECT_AT1BRKLUT
  *           @arg @ref FL_GPIO_FOUT1_SELECT_AT2BRKLUT
  */
__STATIC_INLINE uint32_t FL_GPIO_GetFOUT1(GPIO_COMMON_Type *GPIOx)
{
    return (uint32_t)(READ_BIT(GPIOx->FOUTSEL, GPIO_FOUTSEL_FOUT1_Msk));
}

/**
  * @brief    Get WKUP enable status
  * @rmtoll   PINWKEN    EN    FL_GPIO_ReadWakeup
  * @param    GPIOx GPIO Port
  * @retval   WKUP enable status of port
  */
__STATIC_INLINE uint32_t FL_GPIO_ReadWakeup(GPIO_COMMON_Type *GPIOx)
{
    return (uint32_t)(READ_BIT(GPIOx->PINWKEN, (0x3ffU << 0U)) >> 0U);
}

/**
  * @brief    Get WKUP enable status
  * @rmtoll   PINWKEN    EN    FL_GPIO_IsEnabledWakeup
  * @param    GPIOx GPIO Port
  * @param    wakeup This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_WAKEUP_0
  *           @arg @ref FL_GPIO_WAKEUP_1
  *           @arg @ref FL_GPIO_WAKEUP_2
  *           @arg @ref FL_GPIO_WAKEUP_3
  *           @arg @ref FL_GPIO_WAKEUP_4
  *           @arg @ref FL_GPIO_WAKEUP_5
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_GPIO_IsEnabledWakeup(GPIO_COMMON_Type *GPIOx, uint32_t wakeup)
{
    return (uint32_t)(READ_BIT(GPIOx->PINWKEN, ((wakeup & 0x3ff) << 0x0U)) == ((wakeup & 0x3ff) << 0x0U));
}

/**
  * @brief    WKUP enable
  * @rmtoll   PINWKEN    EN    FL_GPIO_EnableWakeup
  * @param    GPIOx GPIO Port
  * @param    wakeup This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_WAKEUP_0
  *           @arg @ref FL_GPIO_WAKEUP_1
  *           @arg @ref FL_GPIO_WAKEUP_2
  *           @arg @ref FL_GPIO_WAKEUP_3
  *           @arg @ref FL_GPIO_WAKEUP_4
  *           @arg @ref FL_GPIO_WAKEUP_5
  * @retval   None
  */
__STATIC_INLINE void FL_GPIO_EnableWakeup(GPIO_COMMON_Type *GPIOx, uint32_t wakeup)
{
    SET_BIT(GPIOx->PINWKEN, ((wakeup & 0x3ff) << 0x0U));
}

/**
  * @brief    WKUP disable
  * @rmtoll   PINWKEN    EN    FL_GPIO_DisableWakeup
  * @param    GPIOx GPIO Port
  * @param    wakeup This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_WAKEUP_0
  *           @arg @ref FL_GPIO_WAKEUP_1
  *           @arg @ref FL_GPIO_WAKEUP_2
  *           @arg @ref FL_GPIO_WAKEUP_3
  *           @arg @ref FL_GPIO_WAKEUP_4
  *           @arg @ref FL_GPIO_WAKEUP_5
  * @retval   None
  */
__STATIC_INLINE void FL_GPIO_DisableWakeup(GPIO_COMMON_Type *GPIOx, uint32_t wakeup)
{
    CLEAR_BIT(GPIOx->PINWKEN, ((wakeup & 0x3ff) << 0x0U));
}

/**
  * @brief    Set WKUP edge polarity
  * @rmtoll   PINWKEN    SEL    FL_GPIO_SetWakeupEdge
  * @param    GPIOx GPIO Port
  * @param    wakeup This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_WAKEUP_0
  *           @arg @ref FL_GPIO_WAKEUP_1
  *           @arg @ref FL_GPIO_WAKEUP_2
  *           @arg @ref FL_GPIO_WAKEUP_3
  *           @arg @ref FL_GPIO_WAKEUP_4
  *           @arg @ref FL_GPIO_WAKEUP_5
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_WAKEUP_TRIGGER_FALLING
  *           @arg @ref FL_GPIO_WAKEUP_TRIGGER_RISING
  *           @arg @ref FL_GPIO_WAKEUP_TRIGGER_BOTH
  * @retval   None
  */
__STATIC_INLINE void FL_GPIO_SetWakeupEdge(GPIO_COMMON_Type *GPIOx, uint32_t wakeup, uint32_t mode)
{
    MODIFY_REG(GPIOx->PINWKEN, ((wakeup * wakeup) * GPIO_PINWKEN_SEL), ((wakeup * wakeup) * mode));
}

/**
  * @brief    Get WKUP edge polarity
  * @rmtoll   PINWKEN    SEL    FL_GPIO_GetWakeupEdge
  * @param    GPIOx GPIO Port
  * @param    wakeup This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_WAKEUP_0
  *           @arg @ref FL_GPIO_WAKEUP_1
  *           @arg @ref FL_GPIO_WAKEUP_2
  *           @arg @ref FL_GPIO_WAKEUP_3
  *           @arg @ref FL_GPIO_WAKEUP_4
  *           @arg @ref FL_GPIO_WAKEUP_5
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_GPIO_WAKEUP_TRIGGER_FALLING
  *           @arg @ref FL_GPIO_WAKEUP_TRIGGER_RISING
  */
__STATIC_INLINE uint32_t FL_GPIO_GetWakeupEdge(GPIO_COMMON_Type *GPIOx, uint32_t wakeup)
{
    return (uint32_t)(READ_BIT(GPIOx->PINWKEN, ((wakeup * wakeup) * GPIO_PINWKEN_SEL)) / (wakeup * wakeup));
}

/**
  * @brief    Get WKUP interrupt entry
  * @rmtoll   PINWKEN    WKSEL    FL_GPIO_GetWakeupInterruptEntry
  * @param    GPIOx GPIO Port
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_GPIO_WAKEUP_INT_ENTRY_NMI
  *           @arg @ref FL_GPIO_WAKEUP_INT_ENTRY_39
  */
__STATIC_INLINE uint32_t FL_GPIO_GetWakeupInterruptEntry(GPIO_COMMON_Type *GPIOx)
{
    return (uint32_t)(READ_BIT(GPIOx->PINWKEN, GPIO_PINWKEN_WKSEL_Msk));
}

/**
  * @brief    Set WKUP interrupt entry
  * @rmtoll   PINWKEN    WKSEL    FL_GPIO_SetWakeupInterruptEntry
  * @param    GPIOx GPIO Port
  * @param    wakeup This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_WAKEUP_INT_ENTRY_NMI
  *           @arg @ref FL_GPIO_WAKEUP_INT_ENTRY_39
  * @retval   None
  */
__STATIC_INLINE void FL_GPIO_SetWakeupInterruptEntry(GPIO_COMMON_Type *GPIOx, uint32_t wakeup)
{
    MODIFY_REG(GPIOx->PINWKEN, GPIO_PINWKEN_WKSEL_Msk, wakeup);
}

/**
  * @}
  */
FL_ErrorStatus FL_GPIO_DeInit(GPIO_Type *GPIOx, uint32_t pin);
FL_ErrorStatus FL_GPIO_Init(GPIO_Type *GPIOx, FL_GPIO_InitTypeDef *initStruct);
void FL_GPIO_StructInit(FL_GPIO_InitTypeDef *initStruct);
FL_ErrorStatus FL_WKUP_Init(FL_WKUP_InitTypeDef *initStruct, uint32_t wakeup);
FL_ErrorStatus FL_WKUP_DeInit(uint32_t wkupx);
void FL_WKUP_StructInit(FL_WKUP_InitTypeDef *initStruct_Wakeup);
void FL_GPIO_ALLPIN_LPM_MODE(void);

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33LD5XX_FL_GPIO_H*/

/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
